/**
 මෙම ලොඩරය මගින් සින්හල එච්.ටී.එම්.ඈල් ඉන්ග්‍රිසියට පරිවර්තනය කරනු ලෑබේ
 
 ඔබ්ගේ රෑකියා කටයුතු සදහා මෙය භවිතා කිරිම් මගින් ඔබට ඈතිවිය හෑකි විවිද 
 අපදා (බෑනුම් ඈසීම්, ගුටි බෑට හුවමාරු වීම්) සන්දහා අප ආයතනය වග කියනු නොලෑබේ
*/

const XMLලියන්නා = require("xmlbuilder");
const XMLකියවන්නා = require("@rgrove/parse-xml");
const වචනසිතියම = require (__dirname +  "/mappings.json");

//වෙබ් ඇසුරුම ලොඩරය 
function ලෝඩරය(සින්හලකෑල්ල) {
  const ලේඛනය = (XMLකියවන්නා(සින්හලකෑල්ල).children[0]);
  const ඉංග්‍රිසිකෑල්ල = ක්‍රියාවලිය(ලේඛනය);
  return ඉංග්‍රිසිකෑල්ල.toString();
}

//පරිවරිතන ක්‍රියාවලිය මෙමගින් සිදු වේ
function ක්‍රියාවලිය(කියවනටැගය,මව්පියටැගය){

  if (කියවනටැගය.type === "text"){
    if (මව්පියටැගය){
      මව්පියටැගය.text(කියවනටැගය.text);
    }
  }else {
    let පරිවර්තනදත්ත = ටැගයපරිවර්තනයකරන්න(කියවනටැගය);

    if (!මව්පියටැගය){
      මව්පියටැගය = XMLලියන්නා.create("html", පරිවර්තනදත්ත.attributes);
    }else {
      මව්පියටැගය = මව්පියටැගය.ele(පරිවර්තනදත්ත.name, පරිවර්තනදත්ත.attributes);
    }
  
    if (කියවනටැගය.children){
      for (const පුත්‍රයා of කියවනටැගය.children){
        ක්‍රියාවලිය(පුත්‍රයා,මව්පියටැගය);
      }
    }
    
    return මව්පියටැගය;
  }

}

//ටෑග් පරිවරිතන ක්‍රියාවලිය මෙමගින් සිදු වේ
function ටැගයපරිවර්තනයකරන්න(කියවනටැගය){
  const පරිවර්තනදත්ත = {};

  if (වචනසිතියම[කියවනටැගය.name]){
    const සින්හලවචනසෙට්එක = වචනසිතියම[කියවනටැගය.name];
 
    පරිවර්තනදත්ත.name = සින්හලවචනසෙට්එක.name;
    
    let ගතිගුණ  = Object.assign({},වචනසිතියම["පොදු"].attributes,සින්හලවචනසෙට්එක.attributes);

    let අලුත්ඈට්‍රිබියුට්ටික = {};

    for (const තියනඈට්‍රිබියුට්නම in කියවනටැගය.attributes){

      const ඈට්‍රිබියුට්බඩුව = ගතිගුණ[තියනඈට්‍රිබියුට්නම];
      
      if (ඈට්‍රිබියුට්බඩුව){
        const ඉංග්‍රිසිඈට්‍රිබියුට්නම = ඈට්‍රිබියුට්බඩුව.name;
        let ඈට්‍රිබියුට්අගය = කියවනටැගය.attributes[තියනඈට්‍රිබියුට්නම];
        
        if (ඈට්‍රිබියුට්බඩුව.values){
          if (ඈට්‍රිබියුට්බඩුව.values[ඈට්‍රිබියුට්අගය]){
            ඈට්‍රිබියුට්අගය = ඈට්‍රිබියුට්බඩුව.values[ඈට්‍රිබියුට්අගය];
          }
        }

        අලුත්ඈට්‍රිබියුට්ටික[ඉංග්‍රිසිඈට්‍රිබියුට්නම] = ඈට්‍රිබියුට්අගය;
      }else {
        අලුත්ඈට්‍රිබියුට්ටික[තියනඈට්‍රිබියුට්නම] = කියවනටැගය.attributes[තියනඈට්‍රිබියුට්නම]; 
      }
    }
    පරිවර්තනදත්ත.attributes = අලුත්ඈට්‍රිබියුට්ටික;

  }else {
      පරිවර්තනදත්ත.name = කියවනටැගය.name;
      පරිවර්තනදත්ත.attributes = කියවනටැගය.attributes;
  }

  return පරිවර්තනදත්ත;
}

// const පරීක්ෂක = ලෝඩරය((require("fs")).readFileSync("src/index.html","utf-8"));
// console.log(පරීක්ෂක);

module.exports =  ලෝඩරය;

